#+TITLE: Intro To Comp Thinking Week 5 Tutorial
#+AUTHOR: Hankertrix
#+STARTUP: showeverything
#+OPTIONS: toc:2

* Question 3
#+begin_src python :results output
i = 1
j = 0
while i < 10:
    i += 1
    j += 2 * 2

print(i)  # Line 1
print(j)  # Line 2
#+end_src

#+RESULTS:
: 10
: 36


* Question 6
#+begin_src python :results output
for x in range(10):
    y = x
    while y < 7:
        print(y, end=" ")
        y += 2
        if y > 5:
            break
#+end_src

#+RESULTS:
: 0 2 4 1 3 5 2 4 3 5 4 5 6


